In [1]:
##mdarray 개요
##ndarray는 넘파이 기반 데이터 타입으로 다차원 배열을 쉽게 생성하고 다양한 연산을 수행할 수 있습니다.

import numpy as np

In [7]:
##array()함수는 파이썬의 리스트와 같은 인자랄 받아서 ndarray로 변환하는 기능을 수행합니다.
##shape변수는 ndarray의 크기, 즉 (행,열)이라는 정보를 줍니다.

array1 = np.array([1,2,3])            ##1차원 데이터
print(type(array1))
print(array1.shape)
print(array1.ndim)
print(array1.dtype)

array2 = np.array([[1,2,3]])          ##2차원 데이터
print(type(array2))
print(array2.shape)
print(array2.ndim)
print(array2.dtype)

<class 'numpy.ndarray'>
(3,)
1
int32
<class 'numpy.ndarray'>
(1, 3)
2
int32

In [8]:
##astype("자료형")함수를 통해 ndarray에 저장된 자료형을 바꿀 수 있습니다.
##ndarray를 만들때 많은 메모리가 사용되기 때문에 큰 데이터 타입이 굳이 필요 없을때 작은 데이터 타입으로 바꿀때 사용됩니다.

array_int = np.array([1,2,3])
array_float = array_int.astype("float64")
print(array_float, array_float.dtype)

[1. 2. 3.] float64

In [13]:
##arange()함수는 연속된 숫자를 가진 배열을 생성하기 위해, zeros()는 전부 0으로 초기화 하기 위해, ones()는 전부 1로 초기화 하기 위해
##사용합니다.

seq_array = np.arange(10)
print(seq_array, seq_array.dtype)

zero = np.zeros((3,2), dtype = 'int64')
print(zero, zero.dtype)

one = np.ones((3,2))          ##dtype를 따로 주지 않으면 default로 float64형이 됨.
print(one, one.dtype)

[0 1 2 3 4 5 6 7 8 9] int32
[[0 0]
 [0 0]
 [0 0]] int64
[[1. 1.]
 [1. 1.]
 [1. 1.]] float64

In [15]:
##reshape()함수는 ndarray를 특정 차원 및 크기로 변환합니다. 
array1 = np.arange(10)
a2 = array1.reshape(2,5)
print(a2)

##인자로 -1을 주면 알아서 그 값을 계산해서 출력합니다.
a3 = array1.reshape(-1,2)
print(a3)

[[0 1 2 3 4]
 [5 6 7 8 9]]
[[0 1]
 [2 3]
 [4 5]
 [6 7]
 [8 9]]

In [20]:
###인덱싱
###ndarray 내의 일부 데이터 세트나 특정 데이터만을 선택할 수 있습니다.
a = np.arange(10)
a = a.reshape(-1,5)
print(a[0][1])
print(a[0,1])

print(a[1][3])
print(a[1,3])

##보시는 것처럼 행, 열 순으로 인덱싱을 하면 해당 원소를 출력합니다.
##하나의 []를 사용하거나 두개의 []를 사용해도 결과가 같습니다.

1
1
8
8

In [27]:
##슬라이싱

##1차원
a = np.arange(1,10)
print(a)
print(a[1:4])
print("\n")
##2차원
b = a.reshape(3,3)
print(b)
print("\n")
print(b[0:2, 0:2])
print("\n")
print(b[0:2, :])
print("\n")
print(b[:, 0:2])
print("\n")
print(b[:,:])

[1 2 3 4 5 6 7 8 9]
[2 3 4]


[[1 2 3]
 [4 5 6]
 [7 8 9]]


[[1 2]
 [4 5]]


[[1 2 3]
 [4 5 6]]


[[1 2]
 [4 5]
 [7 8]]


[[1 2 3]
 [4 5 6]
 [7 8 9]]

In [29]:
##팬시인덱싱은 리스트나 ndarray로 인덱스로 인덱스 집합을 지정하면 해당 위치의 인덱스에 해당하는 ndarray르 반환하는 인덱싱 방법입니다.
a = np.arange(1,10)
a = a.reshape(3,3)

print(a[[0,1], 2])
print("\n")
print(a[[0,1], 0:2])
print("\n")
print(a[[0,1]])

[3 6]


[[1 2]
 [4 5]]


[[1 2 3]
 [4 5 6]]

In [31]:
##Boolean indexing은 조건 필터링과 검색을 동시에 할 수 있는 방법입니다.
a = np.arange(1,10)
print(a>5)
b = a[a>5]
print(b)
##결과를 보시면 단순이 a>5라고 하면 전체 원소중 참인것은 True, 거진인 것은 False가 되도록 출력됩니다.
##이를 다시 인덱싱인자로 넣으면 False는 무시하고 True값들만 모아서 새로운 ndarray를 반환합니다.

[False False False False False  True  True  True  True]
[6 7 8 9]

In [33]:
##행렬을 정렬하는 방법은 두가지가 있는데 np.sort()와 ndarray.sort()입니다.
##두가지의 차이점은 np.sort()는 원 형렬은 그대로 유지한 채 원 행렬의 정렬된 행렬을 반환하며,
##ndarray.sort()는 원 행렬 자체를 정렬한 형태로 변환하며 반환값은 None입니다.

a = np.array([3,1,9,5])
b = np.sort(a)

print(a)
print(b)

##원본은 유지한채 새로운 행렬 반환하는 것을 알 수 있습니다.

c = a.sort()
print(c)
print(a)

#None를 반환하고, 원래 행렬이 변하는 것을 알 수 있습니다.

[3 1 9 5]
[1 3 5 9]
None
[1 3 5 9]

In [34]:
##2차원 행렬을 정렬할 때에는 axis를 지정해주어야 하는데 0은 행방향, 1은 열 방향으로 정렬한다.
a = np.array([[8,12],
            [7,1]])
b = np.sort(a, axis = 0)
print(b, "\n")
c = np.sort(a, axis = 1)
print(c)

[[ 7  1]
 [ 8 12]]

[[ 8 12]
 [ 1  7]]

In [36]:
##np.argsort()는 정렬 이전 원본 행렬의 원소에 대한 인덱스를 반환합니다.
a = np.array([3,1,9,5])
b = np.argsort(a)
print(b)

[1 0 3 2]

In [38]:
import pandas as pd

#read_csv함수를 통해서 csv파일을 데이터프레임으로 불러올 수 있습니다.
titanic_df = pd.read_csv('titanic_train.csv')
print(titanic_df.head(3))

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S

In [39]:
print(titanic_df.shape)            ##데이터프레임의 크기를 알려주는 함수
print(titanic_df.info())           ##데이터프레임의 정보를 요약해주는 함수

(891, 12)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

In [40]:
print(titanic_df.describe())   ##데이터프레임의 통계 분포에 대한 정보 요약해주는 함수, 숫자가 있는 열에서만 값을 출력해줍니다.

       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200

In [41]:
##데이터프레임 만드는 방법
list1 = [[1,2,3], [11,12,13]]
array1 = np.array(list1)

list_df = pd.DataFrame(list1, columns = ['a', 'b', 'c'])
print(list_df, "\n")

array_df= pd.DataFrame(array1, columns = ['a', 'b', 'c'])
print(array_df, "\n")

dict = {'a': [1,2], 'b': [3,4], 'c': [5,6]}
dict_df = pd.DataFrame(dict)
print(dict_df)

    a   b   c
0   1   2   3
1  11  12  13

    a   b   c
0   1   2   3
1  11  12  13

   a  b  c
0  1  3  5
1  2  4  6

In [42]:
#데이터프레임을 ndarray, 리스트, 딕셔너리로 변환하기

array2 = dict_df.values               ##객체의 values를 이용하면 ndaray로 변환됨.
print(array2)

list2 = dict_df.values.tolist()
print(list2)

dict2=  dict_df.to_dict('list')
print(dict2)

[[1 3 5]
 [2 4 6]]
[[1, 3, 5], [2, 4, 6]]
{'a': [1, 2], 'b': [3, 4], 'c': [5, 6]}

In [43]:
#데이터 프레임에 열 추가하는 방법
##객처["열이름"] = 값 처럼 하면 열이 추가됨
titanic_df["age_0"] = 0
print(titanic_df.head(3))

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked  age_0
0      0         A/5 21171   7.2500   NaN        S      0
1      0          PC 17599  71.2833   C85        C      0
2      0  STON/O2. 3101282   7.9250   NaN        S      0

In [44]:
##열 삭제
titanic_df.drop('age_0', axis = 1, inplace= True)
print(titanic_df.head(3))

#inplace라는 옵션은 자기 자신을 바꿀것인지에 대한 옵션입니다.
#여러 열을 삭제하려면 리스트 형식으로 열 이름들을 한번에 전달하면 됩니다.

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S

In [45]:
titanic_df = pd.read_csv('titanic_train.csv')
print(titanic_df.index.values)

[  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

In [46]:
##reset_index()는 기존 인덱스를 열로 바꾸고 연속된 숫자를 인덱스로 하는 함수입니다.
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)
b = value_counts.reset_index(inplace=False)
print(b)

3    491
1    216
2    184
Name: Pclass, dtype: int64
   index  Pclass
0      3     491
1      1     216
2      2     184

In [50]:
##iloc연산자
##데이터프레임 객체의 원소를 위치기반으로 인덱싱할 때 사용합니다.

print(titanic_df.iloc[0,0])

1

In [56]:
##loc연산자
##데이터프레임 객체의 원소를 명칭기반으로 인덱싱할 때 사용합니다.
print(titanic_df.head(3))
print("\n")
print(titanic_df.loc[0, "Survived"])

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S


0

In [58]:
##bolean indexing
##numpy에서 다뤘던 방식과 같은 방식으로 사용하면 됩니다.

titanic_boolean = titanic_df[titanic_df['Age']>60]
print(titanic_boolean)

     PassengerId  Survived  Pclass                                       Name  \
33            34         0       2                      Wheadon, Mr. Edward H
54            55         0       1             Ostby, Mr. Engelhart Cornelius
96            97         0       1                  Goldschmidt, Mr. George B
116          117         0       3                       Connors, Mr. Patrick
170          171         0       1                  Van der hoef, Mr. Wyckoff
252          253         0       1                  Stead, Mr. William Thomas
275          276         1       1          Andrews, Miss. Kornelia Theodosia
280          281         0       3                           Duane, Mr. Frank
326          327         0       3                  Nysveen, Mr. Johan Hansen
438          439         0       1                          Fortune, Mr. Mark
456          457         0       1                  Millet, Mr. Francis Davis
483          484         1       3                     Turkula, Mrs. (Hedwig)
493          494         0       1                    Artagaveytia, Mr. Ramon
545          546         0       1               Nicholson, Mr. Arthur Ernest
555          556         0       1                         Wright, Mr. George
570          571         1       2                         Harris, Mr. George
625          626         0       1                      Sutton, Mr. Frederick
630          631         1       1       Barkworth, Mr. Algernon Henry Wilson
672          673         0       2                Mitchell, Mr. Henry Michael
745          746         0       1               Crosby, Capt. Edward Gifford
829          830         1       1  Stone, Mrs. George Nelson (Martha Evelyn)
851          852         0       3                        Svensson, Mr. Johan

        Sex   Age  SibSp  Parch       Ticket      Fare        Cabin Embarked
33     male  66.0      0      0   C.A. 24579   10.5000          NaN        S
54     male  65.0      0      1       113509   61.9792          B30        C
96     male  71.0      0      0     PC 17754   34.6542           A5        C
116    male  70.5      0      0       370369    7.7500          NaN        Q
170    male  61.0      0      0       111240   33.5000          B19        S
252    male  62.0      0      0       113514   26.5500          C87        S
275  female  63.0      1      0        13502   77.9583           D7        S
280    male  65.0      0      0       336439    7.7500          NaN        Q
326    male  61.0      0      0       345364    6.2375          NaN        S
438    male  64.0      1      4        19950  263.0000  C23 C25 C27        S
456    male  65.0      0      0        13509   26.5500          E38        S
483  female  63.0      0      0         4134    9.5875          NaN        S
493    male  71.0      0      0     PC 17609   49.5042          NaN        C
545    male  64.0      0      0          693   26.0000          NaN        S
555    male  62.0      0      0       113807   26.5500          NaN        S
570    male  62.0      0      0  S.W./PP 752   10.5000          NaN        S
625    male  61.0      0      0        36963   32.3208          D50        S
630    male  80.0      0      0        27042   30.0000          A23        S
672    male  70.0      0      0   C.A. 24580   10.5000          NaN        S
745    male  70.0      1      1    WE/P 5735   71.0000          B22        S
829  female  62.0      0      0       113572   80.0000          B28      NaN
851    male  74.0      0      0       347060    7.7750          NaN        S

In [60]:
a = titanic_df[titanic_df['Age']>60][['Name', 'Age']]
print(a.head(3))

                              Name   Age
33           Wheadon, Mr. Edward H  66.0
54  Ostby, Mr. Engelhart Cornelius  65.0
96       Goldschmidt, Mr. George B  71.0

In [61]:
##정렬 방법
##sort_values()메소드를 이용하는데 by옵션은 정렬 기준이 되는 열, ascending은 오름차순 여부, inplace는 객제 자신에 적용 여부를 나타냅니다.
titanic_sorted = titanic_df.sort_values(by='Name')
print(titanic_sorted)

     PassengerId  Survived  Pclass                                   Name  \
845          846         0       3                    Abbing, Mr. Anthony
746          747         0       3            Abbott, Mr. Rossmore Edward
279          280         1       3       Abbott, Mrs. Stanton (Rosa Hunt)
308          309         0       2                    Abelson, Mr. Samuel
874          875         1       2  Abelson, Mrs. Samuel (Hannah Wizosky)
..           ...       ...     ...                                    ...
286          287         1       3                de Mulder, Mr. Theodore
282          283         0       3              de Pelsmaeker, Mr. Alfons
361          362         0       2              del Carlo, Mr. Sebastiano
153          154         0       3        van Billiard, Mr. Austin Blyler
868          869         0       3            van Melkebeke, Mr. Philemon

        Sex   Age  SibSp  Parch         Ticket     Fare Cabin Embarked
845    male  42.0      0      0      C.A. 5547   7.5500   NaN        S
746    male  16.0      1      1      C.A. 2673  20.2500   NaN        S
279  female  35.0      1      1      C.A. 2673  20.2500   NaN        S
308    male  30.0      1      0      P/PP 3381  24.0000   NaN        C
874  female  28.0      1      0      P/PP 3381  24.0000   NaN        C
..      ...   ...    ...    ...            ...      ...   ...      ...
286    male  30.0      0      0         345774   9.5000   NaN        S
282    male  16.0      0      0         345778   9.5000   NaN        S
361    male  29.0      1      0  SC/PARIS 2167  27.7208   NaN        C
153    male  40.5      0      2       A/5. 851  14.5000   NaN        S
868    male   NaN      0      0         345777   9.5000   NaN        S

[891 rows x 12 columns]

In [62]:
##groupby()함수의 by옵션에 칼럼을 입력하면 대상 칼럼으로 그룹핑됩니다.
titanic_groupby = titanic_df.groupby(by='Pclass')
print(titanic_groupby)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000021ED417ED88>

In [63]:
titanic_groupby.count()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

In [64]:
titanic_groupby[['PassengerId', 'Survived']].count()

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

In [65]:
##여러개의 aggregation 함수를 이용하기 위해서는 agg메소드를 사용하면 된다.
titanic_groupby['Age'].agg([max, min])

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

In [66]:
agg_format = {'Age':'max', 'SibSp':'sum' , "Fare":'mean'}
titanic_groupby.agg(agg_format)

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

In [73]:
##결손 데이터 처리하기
##isna라는 함수를 통해 결측치 여부를, fillns라는 함수를 통해 NaN 값을 다른 값으로 대체 가능합니다.
print("\n")
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [78]:
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('c000')
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,c000,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,c000,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,c000,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,c000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,c000,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,c000,Q

In [82]:
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())
titanic_df['Embarked']= titanic_df['Embarked'].fillna('S')
titanic_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [83]:
##apply lambda는 파이썬 lambda함수와 똑같은 방식으로 사용하면 됩니다.
titanic_df['Name_len'] = titanic_df['Name'].apply(lambda x: len(x))
titanic_df[['Name', 'Name_len']].head(3)

                                                Name  Name_len
0                            Braund, Mr. Owen Harris        23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...        51
2                             Heikkinen, Miss. Laina        22

In [84]:
titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x: 'Child' if x<=15 else 'Adult')
titanic_df[['Age', 'Child_Adult']].head(8)

         Age Child_Adult
0  22.000000       Adult
1  38.000000       Adult
2  26.000000       Adult
3  35.000000       Adult
4  35.000000       Adult
5  29.699118       Adult
6  54.000000       Adult
7   2.000000       Child